# GetFPathName

## Description
Returns the fully-qualified filename of the active document.

```pascal
FUNCTION GetFPathName : STRING;
```

```python
def vs.GetFPathName():
    return STRING
```

## Version
Availability: from Vectorworks 2014

## Category
* File I@O